Reports/ТриСуммы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Report>
		<Properties>
			<Name>ТриСуммы</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:TaskRef.Мероприятие</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccumulationRegisters/ЗадолженностьПоОбъектамВнесудебная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>ЗадолженностьПоОбъектамВнесудебная</Name>
			<Comment>Внесудебная задолженность по долговым обязательтвам</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаДО</Name>
					<Comment>Сумма задолженности в валюте долгового обязательства</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРегл</Name>
					<Comment>Сумма задолженности в валюте регламентированного учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойДолгДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойДолгРегл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентыДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентыРегл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШтрафыДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШтрафыРегл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПениДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПениРегл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая1ДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая1Регл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая2ДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая2Регл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая3ДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая3Регл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая4ДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая4Регл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая5ДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая5Регл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая6ДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая6Регл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая7ДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая7Регл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая8ДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая8Регл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидДвиженияЗадолженности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидДвиженияЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Comment>Дополнительная аналитика</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ИсковыеТребования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>ИсковыеТребования</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаОсновнойДолг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПроценты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаШтрафы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаИска</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаГоспошлина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидТребований</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыИсковыхТребований</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Займ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ЗадолженностьПоСудебнымРешениям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>ЗадолженностьПоСудебнымРешениям</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидДвиженияЗадолженности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидДвиженияЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Займ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Решение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СудебноеДело</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЧастьРешения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЗадолженности</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыЗадолженностиПоРешению</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВидДвиженияЗадолженности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидДвиженияЗадолженности</Name>
			<Comment>Трейд Софт</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Начисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Списание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отозвано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СудебноеРешение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/ТриСуммы/Ext/ObjectModule.bsl
Процедура ЗаполнитьТабличныйДокумент(ТабДок) Экспорт
	
	Макет = ЭтотОбъект.ПолучитьМакет("МакетДолг");
	ТабДок.Очистить();	
	
	Область = Макет.ПолучитьОбласть("ШапкаДолг");	
	
	Если ТипЗнч(Объект) <> Тип("СправочникСсылка.ДолговыеОбязательства") Тогда
		ТабДок.Вывести(Область); 
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЕСТЬNULL(ЗадолженностьПоОбъектамВнесудебнаяОстатки.ОсновнойДолгРеглОстаток, 0) КАК ОсновнойДолг,
	                      |	ЕСТЬNULL(ЗадолженностьПоОбъектамВнесудебнаяОстатки.ПроцентыРеглОстаток, 0) КАК Проценты,
	                      |	ЕСТЬNULL(ЗадолженностьПоОбъектамВнесудебнаяОстатки.ШтрафыРеглОстаток, 0) КАК Штрафы,
	                      |	ЕСТЬNULL(ЗадолженностьПоОбъектамВнесудебнаяОстатки.ПениРеглОстаток, 0) КАК Пени,
	                      |	-ЕСТЬNULL(ЗадолженностьПоОбъектамВнесудебнаяОстатки.Составляющая8РеглОстаток, 0) КАК Переплата,
	                      |	ЕСТЬNULL(ЗадолженностьПоОбъектамВнесудебнаяОстатки.СуммаДООстаток, 0) КАК Итого
	                      |ИЗ
	                      |	Справочник.ДолговыеОбязательства КАК ДолговыеОбязательства
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностьПоОбъектамВнесудебная.Остатки КАК ЗадолженностьПоОбъектамВнесудебнаяОстатки
	                      |		ПО (ЗадолженностьПоОбъектамВнесудебнаяОстатки.Объект = ДолговыеОбязательства.Ссылка)
	                      |ГДЕ
	                      |	ДолговыеОбязательства.Ссылка = &Объект");
	Запрос.УстановитьПараметр("Объект", Объект);
	ДРезультат = Запрос.Выполнить().Выбрать();
	ДРезультат.Следующий();
	
	Область.Параметры.ДОсновнойДолг = Формат(ДРезультат.ОсновнойДолг, "ЧДЦ=2; ЧН=0");
	Область.Параметры.ДПроценты = Формат(ДРезультат.Проценты, "ЧДЦ=2; ЧН=0");
	Область.Параметры.ДШтрафы = Формат(ДРезультат.Штрафы, "ЧДЦ=2; ЧН=0");
	Область.Параметры.ДПени = Формат(ДРезультат.Пени, "ЧДЦ=2; ЧН=0");
	Область.Параметры.ДИтого = Формат(ДРезультат.Итого, "ЧДЦ=2; ЧН=0");	
	
	Если ДРезультат.Переплата = 0 Тогда
		Область.Параметры.ДПереплата = "";
		Область.Параметры.ДСтрПереплата = "";
		Область.Параметры.ДВалюта = "";			
	Иначе
		Область.Параметры.ДПереплата = Формат(ДРезультат.Переплата, "ЧДЦ=2; ЧН=0");
		Область.Параметры.ДСтрПереплата = "Переплата:";
		Область.Параметры.ДВалюта = Константы.ВалютаРегламентированногоУчета.Получить().НаименованиеПолное + ".";		
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ИсковыеТребованияОстатки.Займ КАК Займ,
	                      |	ЕСТЬNULL(ИсковыеТребованияОстатки.СуммаОсновнойДолгОстаток, 0) КАК ОсновнойДолг,
	                      |	ЕСТЬNULL(ИсковыеТребованияОстатки.СуммаПроцентыОстаток, 0) КАК Проценты,
	                      |	ЕСТЬNULL(ИсковыеТребованияОстатки.СуммаШтрафыОстаток, 0) КАК Штрафы,
	                      |	ЕСТЬNULL(ИсковыеТребованияОстатки.СуммаПениОстаток, 0) КАК Пени,
	                      |	ЕСТЬNULL(ИсковыеТребованияОстатки.ЦенаИскаОстаток, 0) КАК Итого,
	                      |	ЕСТЬNULL(ИсковыеТребованияОстатки.СуммаГоспошлинаОстаток, 0) КАК Госпошлина
	                      |ИЗ
	                      |	Справочник.ДолговыеОбязательства КАК ДолговыеОбязательства
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ИсковыеТребования.Остатки КАК ИсковыеТребованияОстатки
	                      |		ПО (ИсковыеТребованияОстатки.Займ = ДолговыеОбязательства.Ссылка)
	                      |ГДЕ
	                      |	ДолговыеОбязательства.Ссылка = &Займ");
	Запрос.УстановитьПараметр("Займ", Объект);
	ИскРезультат = Запрос.Выполнить().Выбрать();
	ИскРезультат.Следующий();
	
	Область.Параметры.ИскОсновнойДолг = Формат(ИскРезультат.ОсновнойДолг, "ЧДЦ=2; ЧН=0");
	Область.Параметры.ИскПроценты = Формат(ИскРезультат.Проценты, "ЧДЦ=2; ЧН=0");
	Область.Параметры.ИскШтрафы = Формат(ИскРезультат.Штрафы, "ЧДЦ=2; ЧН=0");
	Область.Параметры.ИскПени = Формат(ИскРезультат.Пени, "ЧДЦ=2; ЧН=0");
	Область.Параметры.ИскГоспошлина = Формат(ИскРезультат.Госпошлина, "ЧДЦ=2; ЧН=0");
	Попытка
		Область.Параметры.ИскИтого = Формат(ИскРезультат.Итого + ИскРезультат.Госпошлина, "ЧДЦ=2; ЧН=0");
	Исключение
	КонецПопытки; 
	
	Если ДРезультат.Итого <> Неопределено И ДРезультат.Итого <> Неопределено Тогда	
		РазницаПодачи =  ДРезультат.Итого - ИскРезультат.Итого;
		
		Если РазницаПодачи < 0 и ДРезультат.Итого <> 0  тогда
			Область.Параметры.Аларм = "Внимание! Общая сумма платежей больше, чем общая задолженность. Переплата: "+ (-РазницаПодачи)+" руб."
		КонецЕсли;	
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЗадолженностьПоСудебнымРешениямОстатки.Займ КАК Займ,
	                      |	ЗадолженностьПоСудебнымРешениямОстатки.ТипЗадолженности КАК ТипЗадолженности,
	                      |	ЗадолженностьПоСудебнымРешениямОстатки.СуммаОстаток КАК СуммаОстаток
	                      |ИЗ
	                      |	РегистрНакопления.ЗадолженностьПоСудебнымРешениям.Остатки КАК ЗадолженностьПоСудебнымРешениямОстатки
	                      |ГДЕ
	                      |	ЗадолженностьПоСудебнымРешениямОстатки.Займ = &Займ");
	Запрос.УстановитьПараметр("Займ", Объект);
	РешРезультат = Запрос.Выполнить().Выгрузить();
	
	СписокСоставляющих = СписокСоставляющих();
	Для Каждого Элемент Из СписокСоставляющих Цикл
		стр = Новый Структура("ТипЗадолженности", Элемент);
		Строки = РешРезультат.НайтиСтроки(стр);
		Если Строки.Количество() > 0 Тогда
			Сумма = Строки[0].СуммаОстаток;
		Иначе
			Сумма = 0;
		КонецЕсли;
		Область.Параметры["Реш" + Элемент.ИмяПредопределенныхДанных] = Формат(Сумма, "ЧДЦ=2; ЧН=0"); 
	КонецЦикла;
		
	стр = Новый Структура("ТипЗадолженности", ПланыВидовХарактеристик.ТипыЗадолженностиПоРешению.Переплата);
	Строки = РешРезультат.НайтиСтроки(стр);
	Если Строки.Количество() > 0 Тогда
		СуммаПереплата = Строки[0].СуммаОстаток;
	Иначе
		СуммаПереплата = 0;
	КонецЕсли;
		
	Если СуммаПереплата = 0 Тогда
		Область.Параметры.РешПереплата = "";
		Область.Параметры.РешСтрПереплата = "";
		Область.Параметры.РешВалюта = "";			
	Иначе
		Область.Параметры.РешПереплата = Формат(СуммаПереплата, "ЧДЦ=2; ЧН=0");
		Область.Параметры.РешСтрПереплата = "Переплата:";
		Область.Параметры.РешВалюта = Константы.ВалютаРегламентированногоУчета.Получить().НаименованиеПолное + ".";		
	КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗадолженностьПоСудебнымРешениямОстатки.Займ КАК Займ,
	               |	ЗадолженностьПоСудебнымРешениямОстатки.СуммаОстаток КАК СуммаОстаток
	               |ИЗ
	               |	РегистрНакопления.ЗадолженностьПоСудебнымРешениям.Остатки КАК ЗадолженностьПоСудебнымРешениямОстатки
	               |ГДЕ
	               |	ЗадолженностьПоСудебнымРешениямОстатки.Займ = &Займ";
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		СуммаИтого = Результат.СуммаОстаток;
	Иначе
		СуммаИтого = 0;
	КонецЕсли;
	
	Область.Параметры.РешИтого = Формат(СуммаИтого, "ЧДЦ=2; ЧН=0");	
	
		
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЕСТЬNULL(СУММА(ЗадолженностьПоОбъектамВнесудебная.СуммаРегл), 0) КАК СуммаРегл
	                      |ИЗ
	                      |	РегистрНакопления.ЗадолженностьПоОбъектамВнесудебная КАК ЗадолженностьПоОбъектамВнесудебная
	                      |ГДЕ
	                      |	ЗадолженностьПоОбъектамВнесудебная.Объект = &Объект
	                      |	И ЗадолженностьПоОбъектамВнесудебная.ВидДвиженияЗадолженности = ЗНАЧЕНИЕ(Перечисление.ВидДвиженияЗадолженности.Оплата)");
	Запрос.УстановитьПараметр("Объект", Объект);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Сумма1 = Результат.СуммаРегл;
	Иначе
		Сумма1 = 0;
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЕСТЬNULL(СУММА(ЗадолженностьПоСудебнымРешениям.Сумма), 0) КАК СуммаРешения
	                      |ИЗ
	                      |	РегистрНакопления.ЗадолженностьПоСудебнымРешениям КАК ЗадолженностьПоСудебнымРешениям
	                      |ГДЕ
	                      |	ЗадолженностьПоСудебнымРешениям.Займ = &Займ
	                      |	И ЗадолженностьПоСудебнымРешениям.ВидДвиженияЗадолженности = ЗНАЧЕНИЕ(Перечисление.ВидДвиженияЗадолженности.Оплата)");
	Запрос.УстановитьПараметр("Займ", Объект);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Сумма2 = Результат.СуммаРешения;
	Иначе
		Сумма2 = 0;
	КонецЕсли;
	
	Область.Параметры.Сумма1 = Формат(Сумма1, "ЧДЦ=2; ЧН=0");;
	Область.Параметры.Сумма2 = Формат(Сумма2, "ЧДЦ=2; ЧН=0");
	
	Область.Параметры.Валюта = Константы.ВалютаРегламентированногоУчета.Получить().НаименованиеПолное;	
	
	ТабДок.Вывести(Область);  
	

КонецПроцедуры

Функция СписокСоставляющих()
	Массив = Новый Массив;
	
	Массив.Добавить(ПланыВидовХарактеристик.ТипыЗадолженностиПоРешению.Госпошлина);
	Массив.Добавить(ПланыВидовХарактеристик.ТипыЗадолженностиПоРешению.Проценты);
	Массив.Добавить(ПланыВидовХарактеристик.ТипыЗадолженностиПоРешению.ОсновнойДолг);
	Массив.Добавить(ПланыВидовХарактеристик.ТипыЗадолженностиПоРешению.Пени);
	Массив.Добавить(ПланыВидовХарактеристик.ТипыЗадолженностиПоРешению.Штрафы);
	Массив.Добавить(ПланыВидовХарактеристик.ТипыЗадолженностиПоРешению.Переплата);
	
	Возврат Массив;
	
КонецФункции
